nxp-mcuxpresso/mcux-soc-svd/MCXW70AC/MCXW70AC.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="CDOG_0">
      <name>CDOG_1</name>
      <description>Code Watchdog Timer</description>
      <groupName>CDOG</groupName>
      <baseAddress>0x40130000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CDOG1</name>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ZLL</name>
      <description>ZLL</description>
      <groupName>ZLL</groupName>
      <baseAddress>0x40101000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IRQSTS</name>
          <description>INTERRUPT REQUEST STATUS (IRQSTS). The IRQSTS register indicates the status of interrupt requests in the802.15.4 module.</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQIRQ</name>
              <description>Sequencer IRQ Sequence-end Interrupt Status bit. A '1' indicates the completion of an autosequence. This interrupt will assert whenever the Sequence Manager transitions from non-idle to idle state, for any reason. This is write a '1' to clear bit. 0x0,A Sequencer Interrupt has not occurred, 0x1,A Sequencer Interrupt has occurred</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TXIRQ</name>
              <description>TX IRQ Transmitter Interrupt Status bit. A '1' indicates the completion of a transmit operation. This is write a '1' to clear bit. 0x0,A TX Interrupt has not occurred, 0x1,A TX Interrupt has occurred</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RXIRQ</name>
              <description>RX IRQ Receiver Interrupt Status bit. A '1' indicates the completion of a receive operation. This is write a '1' to clear bit. 0x0,A RX Interrupt has not occurred, 0x1,A RX Interrupt has occurred</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CCAIRQ</name>
              <description>CCA IRQ Clear Channel Assessment Interrupt Status bit. A '1' indicates completion of CCA operation. This is write '1' to clear bit. 0x0,A CCA Interrupt has not occurred, 0x1,A CCA Interrupt has occurred</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RXWTRMRKIRQ</name>
              <description>Receive Watermark IRQ Receiver Byte Count Water Mark Interrupt Status bit. A '1' indicates that the number of bytes specified in the RX_WTR_MARK register has been reached. This is write a '1' to clear bit. 0x0,A Receive Watermark Interrupt has not occurred, 0x1,A Receive Watermark Interrupt has occurred</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FILTERFAIL_IRQ</name>
              <description>Filter Fail IRQ Receiver Packet Filter Fail Interrupt Status bit. A '1' indicates that the most-recently received packet has been rejected due to elements within the packet. This is write a '1' to clear bit. In Dual PAN mode, FILTERFAIL_IRQ applies to either or both networks, as follows: A: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=0, FILTERFAIL_IRQ applies to PAN0. B: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=1, FILTERFAIL_IRQ applies to PAN1. C: If PAN0 and PAN1 occupy the same channel, FILTERFAIL_IRQ is the logical 'AND' of the individual PANs' Filter Fail status. 0x0,A Filter Fail Interrupt has not occurred, 0x1,A Filter Fail Interrupt has occurred</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PLL_UNLOCK_IRQ</name>
              <description>PLL Unlock IRQ PLL Un-lock Interrupt Status bit. A '1' indicates an unlock event has occurred in the PLL. This is write a '1' to clear bit. 0x0,A PLL Unlock Interrupt has not occurred, 0x1,A PLL Unlock Interrupt has occurred</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RX_FRM_PEND</name>
              <description>RX Frame Pending Status of the frame pending bit of the frame control field for the most-recently received packet. Read-only.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WAKE_IRQ</name>
              <description>WAKE Interrupt Request Wake Interrupt. The RFMC TIMER has matched the WOR WKUP_TIME register, and DSM has exited. The 802.15.4 EVENT_TMR has resumed counting. 0x0,A Wake Interrupt has not occurred, 0x1,A Wake Interrupt has occurred</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ARB_GRANT_DEASSERTION_IRQ</name>
              <description>arb_grant Deassertion IRQ arb_grant(!RF_NOT_ALLOWED) Deassertion Interrupt Status bit. A '1' indicates an arb_grant deassertion event has occurred. This is write a '1' to clear bit. 0x0,An arb_grant Deassertion Interrupt has not occurred, 0x1,An arb_grant Deassertion Interrupt has occurred</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TSM_IRQ</name>
              <description>TSM IRQ TSM Interrupt Request 0x0,A TSM Interrupt has not occurred, 0x1,A TSM Interrupt has occurred</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENH_PKT_STATUS</name>
              <description>Enhanced Packet Status 0x0,The last packet received was neither 4e- nor 2015-compliant, 0x1,The last packet received was 4e- or 2015-compliant (RX_FRAME_FILTER, register should be queried for additional status bits)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PI</name>
              <description>Poll Indication 0x0,the received packet was not a data request, 0x1,the received packet was a data request, regardless of whether a, Source Address table match occurred, or whether Source Address Management is enabled or not</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRCADDR</name>
              <description>Source Address Match Status If Source Address Management is engaged, meaning at least one of the following bits is set: SAP0_EN SAA0_EN SAP1_EN SAA1_EN Then SRCADDR will be set to 1 if the packet just received is a poll request (PI=1), and at least one of the following conditions is met: SAP0_EN and SAP0_ADDR_PRESENT SAA0_EN and SAA0_ADDR_ABSENT SAP1_EN and SAP1_ADDR_PRESENT SAA1_EN and SAA1_ADDR_ABSENT If SRCADDR=1, this indicates to SW that the Packet Processor has determined that an auto-TxACK frame must be transmitted with the FramePending subfield of the FrameControlField set to 1. HW will assemble and transmit this Ack packet. If the above conditions are not met, SRCADDR will be cleared to 0.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA</name>
              <description>CCA Status Channel IDLE/BUSY indicator. This indicator is valid at CCAIRQ and also at SEQIRQ. This flag is cleared at next receiver warm up. 0x0,IDLE, 0x1,BUSY</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCVALID</name>
              <description>CRC Valid Status * Code Redundancy Check Valid: This flag indicates the compare result between the FCS field, in the most-recently received frame, and the internally calculated CRC value. This flag is cleared at next receiver warm up. 0x0,Rx FCS != calculated CRC (incorrect), 0x1,Rx FCS = calculated CRC (correct)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TMR1IRQ</name>
              <description>Timer 1 IRQ * Timer Comparator 1 Interrupt Status bit: Indicates T1CMP comparator value matched event timer counter. This is write '1' to clear bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TMR2IRQ</name>
              <description>Timer 2 IRQ * Timer Comparator 2 Interrupt Status bit: Indicates comparator value matched event timer counter. This flag is shared between the T2CMP (24-bit) and T2PRIMECMP (16-bit) compare registers. This is write '1' to clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TMR3IRQ</name>
              <description>Timer 3 IRQ * Timer Comparator 3 Interrupt Status bit: Indicates T3CMP comparator value matched event timer counter. This is write '1' to clear bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TMR4IRQ</name>
              <description>Timer 4 IRQ * Timer Comparator 4 Interrupt Status bit: Indicates T4CMP comparator value matched event timer counter. This is write '1' to clear bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TMR1MSK</name>
              <description>Timer Comparator 1 Interrupt Mask bit 0x0,allows interrupt when comparator matches event timer count, 0x1,Interrupt generation is disabled, but a TMR1IRQ flag can be set</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR2MSK</name>
              <description>Timer Comparator 2 Interrupt Mask bit 0x0,allows interrupt when comparator matches event timer count, 0x1,Interrupt generation is disabled, but a TMR2IRQ flag can be set</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR3MSK</name>
              <description>Timer Comparator 3 Interrupt Mask bit 0x0,allows interrupt when comparator matches event timer count, 0x1,Interrupt generation is disabled, but a TMR3IRQ flag can be set</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR4MSK</name>
              <description>Timer Comparator 4 Interrupt Mask bit 0x0,allows interrupt when comparator matches event timer count, 0x1,Interrupt generation is disabled, but a TMR4IRQ flag can be set</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FRAME_LENGTH</name>
              <description>Receive Frame Length Contents of the PHR (PHY header), or FrameLength field, of the most recently received packet. Read-only.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
