nxp-mcuxpresso/mcux-soc-svd/MCXW70AC/MCXW70AC.xml
        <register>
          <name>ACKDELAY</name>
          <description>ACK DELAY (ACKDELAY)Provides a fine-tune adjustment of the time delay between Rx warmdownand the beginning of Tx warmup for an autoTxAck packet.</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2D0002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACKDELAY</name>
              <description>ACK Delay Provides a fine-tune adjustment of the time delay between Rx warmdown and the beginning of Tx warmup for an Tx Acknowledge packet. ACKDELAY register will apply to both SLOTTED and UNSLOTTED TxAck, but only to TxAck (not T sequences). This is a two's complement value. Resolution = 2us. Range = -128 - 126us. Max ACKDELAY = 0x3F. Min ACKDELAY = 0x40.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDELAY</name>
              <description>TX Delay Provides a fine-tune adjustment of the time delay between post-CCA Rx warm-down and the beginning of Tx warm-up for an Tx (non-Ack) packet. TXDELAY register will apply in both SLOTTED and UNSLOTTED modes, but only to T sequences (e.g., T, TR, and T(R) ), not TxAck operations. This is a two's complement value. The minimum permissible value is -19 (0x2D). Values less than -19 will lead to unexpected results. Resolution = 2us. Range = +/- 62us. Max TXDELAY = 0x1F. Min TXDELAY = 0x2D.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDELAY</name>
              <description>RX Delay Provides a fine-tune adjustment of the time delay between Tx warmdown and the beginning of Rx warmup for TR sequence. RXDELAY register will apply to both SLOTTED and UNSLOTTED TR sequence. This is an unsigned value. Resolution = 2us. Range = 3 - 127us. Max RXDELAY = 0x3F. Min RXDELAY = 0x01.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_TX_WD_EN</name>
              <description>Fast TX_WD enable/disable When this bit is enabled, the Zigbee squence manager executes the fast TX warmdown sequence by bypassing TX_PA_OFF and XTAL_CLK1 and jumping from TX_WD to TSM_WD directly. 0x0,Disable fast Tx warmdown sequence., 0x1,Enable fast Tx warmdown sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_TX_WD_DELAY</name>
              <description>FAST_TX_WD_DELAY Provides a fine-tune adjustment of the time delay from the beginning of Tx warmdown to the end of Tx warmdown when FAST_TX_WD_EN is set to 1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTERFAIL_CODE</name>
          <description>FILTER FAIL CODE (FILTERFAIL_CODE)</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PP_FILTERFAIL_CODE</name>
              <description>Filter Fail Code, packet_processor Code indicating what condition, or conditions, caused the Packet Processor to reject the just-received packet. The bits of FILTERFAIL_CODE indicate the reason for packet rejection. For a description of the individual FILTERFAIL_CODE bits, see the 802.15.4 Link Layer Controller chapter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PPME_FILTERFAIL_CODE</name>
              <description>Filter Fail Code, Programmable Packet Filter Matching Engine (PPME)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FILTERFAIL_CODE_RAW_SEL</name>
              <description>Select PP_FILTERFAIL_CODE before or after filtering by PROMISCOUS, Applied to PAN0 and PAN1 FILTERFAIL_CODES of the packet_processor (not relevant for PPME_FILTERFAIL_CODE) 1'b0: PP_FILTERFAIL_CODE after PROMISCUOUS filtering 1'b1: PP_FILTERFAIL_CODE before PROMISCOUS fitlering</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTERFAIL_PAN_SEL</name>
              <description>PAN Selector for Filter Fail Code 0x0,{ PPME_FILTERFAIL_CODE[1:0], PP_FILTERFAIL_CODE[9:0] } will report the FILTERFAIL status of PAN0, 0x1,{ PPME_FILTERFAIL_CODE[1:0], PP_FILTERFAIL_CODE[9:0] } will report the FILTERFAIL status of PAN1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_WTR_MARK</name>
          <description>RECEIVE WATER MARK (RX_WTR_MARK)</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_WTR_MARK</name>
              <description>RECEIVE WATER MARK Receive byte count (octets) needed to trigger a RXWTRMRKIRQ interrupt . A setting of 0 generates an interrupt at end of the Frame Length field (first byte after SFD). A setting of 1 generates an interrupt after the first byte of Frame Control Field, etc.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_CTRL</name>
          <description>no description available</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_MGR_RST</name>
              <description>Setting this bit will reset all BSM Controller Register. FW should set it and then clear it to assert a reset pulse.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RST</name>
              <description>Setting this bit will reset all Rx Datapath. FW should set it and then clear it to assert a reset pulse.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_RST</name>
              <description>Setting this bit will reset all Tx Datapath. FW should set it and then clear it to assert a reset pulse.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_RST</name>
              <description>This field will reset the PLL but not applicable to WCS FFU Instantiation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGS_RST</name>
              <description>Setting this bit will reset all Interrupt Status Register. FW should set it and then clear it to assert a reset pulse.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZIGBEE_RST</name>
              <description>Setting this bit will reset BSM Controller, Rx/Tx Datapath &amp; Interrupt Status Register. FW should set it and then clear it to assert a reset pulse.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOT_PRELOAD</name>
          <description>SLOT PRELOAD (SLOT_PRELOAD)Slotted Mode Preload</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x74</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLOT_PRELOAD</name>
              <description>Slotted Mode Preload This register represents the number that gets loaded into the slot_timer at SFD detect, which ultimately determines when the next slot boundary will occur. Due to processing delays within the analog front-end and digital modem, the point at which SFD is detected by the modem, is delayed relative to over-the-air timing. This register setting compensates for that delay. This timing parameter is critical for the Sequence R autosequence in SLOTTED mode, when an automatic TxAck is required.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_STATE</name>
          <description>802.15.4 SEQUENCE STATE (SEQ_STATE)802.15.4 Sequence State Register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_STATE</name>
              <description>ZSM Sequence State This read-only register reflects the instantaneous state of the 802.15.4 Sequence Manager</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PREAMBLE_DET</name>
              <description>Preamble Detected 0x0 an 802.15.4 preamble has not been detected. 1: An 802.15.4 preamble has been detected. The function of this read-only bit depends on the setting of the LATCH_PREAMBLE bit of the SEQ_MGR_CTRL register. If LATCH_PREAMBLE=1, any preamble detection during a Sequence R (even false detections), will set this bit, and it will remain set (sticky) until the start of the next autosequence. If LATCH_PREAMBLE=0, this bit is not sticky, and reflects the instantaneous state of the preamble-detection circuit; for false preambles, the bit will clear when the false nature of the preamble is recognized. When LATCH_PREAMBLE=0, PREAMBLE_DET should be considered valid only while an autosequence is underway.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFD_DET</name>
              <description>SFD Detected 0x0 an 802.15.4 preamble-and-SFD have not been detected. 1: An 802.15.4 preamble-and-SFD have been detected. The function of this read-only bit depends on the setting of the LATCH_PREAMBLE bit of the SEQ_MGR_CTRL register. If LATCH_PREAMBLE=1, any preamble-and-SFD detection during a Sequence R (even false detections), will set this bit, and it will remain set (sticky) until the start of the next autosequence. If LATCH_PREAMBLE=0, this bit is not sticky, and reflects the instantaneous state of the SFD-detection circuit; for false SFD, the bit will clear when the false nature of the SFD is recognized (i.e., an RX recycle). When LATCH_PREAMBLE=0, SFD_DET should be considered valid only while an autosequence is underway.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FILTERFAIL_FLAG_SEL</name>
              <description>Consolidated Filter Fail Flag 0x0 The incoming, or just-received packet, passed packet filtering rules. 1: The incoming, or just-received packet, failed packet filtering rules When FILTERFAIL_FLAG_SEL=1, a non-zero FILTERFAIL_CODE is present (see FILTERFAIL_CODE registers). In Dual PAN mode, FILTERFAIL_FLAG_SEL applies to either or both networks, as follows: A: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=0, FILTERFAIL_FLAG_SEL applies to PAN0. B: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=1, FILTERFAIL_FLAG_SEL applies to PAN1. C: If PAN0 and PAN1 occupy the same channel, FILTERFAIL_FLAG_SEL is the logical 'AND' of the individual PANs' FILTERFAIL_FLAG bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCVALID</name>
              <description>CRC Valid Indicator * Cyclic Redundancy Check Valid: This flag indicates the compare result between the FCS field, in the most-recently received frame, and the internally calculated CRC value. This flag is cleared at next receiver warm up. 0x0,Rx FCS != calculated CRC (incorrect), 0x1,Rx FCS = calculated CRC (correct)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_ABORT</name>
              <description>Raw PLL Abort Signal This bit reflects the instantaneous, consolidated status of the PLL unlock detection circuits; if asserted high, indicates that at least one of the three PLL unlock detect mechanisms is currently reporting an unlocked condition.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_ABORTED</name>
              <description>Autosequence has terminated due to an PLL unlock event when asserted, indicates that the autosequence has terminated due to an PLL unlock event. This bit is valid at the SEQIRQ interrupt. Hardware will maintain this bit asserted until the next autosequence commences. This bit is a read-only mirror of the register bit of the same name in the ABORT_STS (SEQ_CTRL_STS) register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PPME_FILTERFAIL_FLAG_SEL</name>
              <description>Consolidated Filter Fail Flag (PPME) 0x0 The incoming, or just-received packet, passed PPME filtering (matching) rules. 1: The incoming, or just-received packet, failed packet filtering (matching) rules When PPME_FILTERFAIL_FLAG_SEL=1, a non-zero PPME_FILTERFAIL_CODE is present (see PPME_FILTERFAIL_CODE registers). In Dual PAN mode, PPME_FILTERFAIL_FLAG_SEL applies to either or both networks, as follows: A: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=0, PPME_FILTERFAIL_FLAG_SEL applies to PAN0. B: If PAN0 and PAN1 occupy different channels and CURRENT_NETWORK=1, PPME_FILTERFAIL_FLAG_SEL applies to PAN1. C: If PAN0 and PAN1 occupy the same channel, PPME_FILTERFAIL_FLAG_SEL is the logical 'AND' of the individual PANs' PPME_FILTERFAIL_FLAG bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_BYTE_COUNT</name>
              <description>Realtime Received Byte Count During packet reception, this read-only register is a real-time indicator of the number of bytes that have been received. This register will read 0 until SFD and PHR have been received. It will read 1 after the first byte of Frame Control Field has been received, etc.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCCA_BUSY_CNT</name>
              <description>Number of CCA Measurements resulting in Busy Channel For Sequence CCCA mode only, this register indicates the number of busy CCA attempts which occurred during the autosequence, before the channel was detected to be idle. This register can also be read in real-time (during the autosequence) to determine how many busy CCA attempts have occurred to that point. The register saturates at 63 (i.e, if there are more than 63 busy attempts, the register will continue to read 63). This register is automatically cleared to zero by hardware when the next autosequence commences. Read-only register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR_PRESCALE</name>
          <description>TIMER PRESCALER (TMR_PRESCALE)Timer Prescaler Control Register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMR_PRESCALE</name>
              <description>Timer Prescaler Timer Prescaler. Establishes the Event Timer clock rate (and also maximum timer duration) Note: To take advantage of the EVENT_TMR Fractional bits for 802.15.4 DSM mode, only the default setting (5, or 62.5KHz) is allowed. 0x0,Reserved, 0x1,Reserved, 0x2,500kHz (33.55 S), 0x3,250kHz (67.11 S), 0x4,125kHz (134.22 S), 0x5,62.5kHz (268.44 S) -- default, 0x6,31.25kHz (536.87 S), 0x7,15.625kHz (1073.74 S)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LENIENCY_LSB</name>
          <description>LENIENCY LSB (LENIENCY_LSB)Packet Processor Leniency Bits (LSB)</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LENIENCY_LSB</name>
              <description>Leniency LSB Register The Packet Processor performs filtering on all received packets, in order to determine whether the packet is intended for the device. The packet filtering is based on rules. In case any of the packet filtering rules need to be overridden, a 43-bit leniency register has been provided. When the leniency register is programmed to its default value (0), all hardware packet filtering rules are in effect, and if an incoming packet violates any rule, a Filter Fail will occur (packet will be rejected). When a given leniency register bit is asserted, the packet filtering rule assigned to that bit will not be in effect, and if any incoming packet violates that rule (but no other rules), then a Filter Fail will not occur, the packet will not be rejected, the packet will be treated as intended for the device, and software will be notified of the incoming packet. For a description of the function of the individual leniency bits, see the 802.15.4 Link Layer Controller chapter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LENIENCY_MSB</name>
          <description>LENIENCY MSB (LENIENCY_MSB)Packet Processor Leniency Bits (MSB)</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LENIENCY_MSB</name>
              <description>Leniency MSB Register The Packet Processor performs filtering on all received packets, in order to determine whether the packet is intended for the device. The packet filtering is based on rules. In case any of the packet filtering rules need to be overridden, a 43-bit leniency register has been provided. When the leniency register is programmed to its default value (0), all hardware packet filtering rules are in effect, and if an incoming packet violates any rule, a Filter Fail will occur (packet will be rejected). When a given leniency register bit is asserted, the packet filtering rule assigned to that bit will not be in effect, and if any incoming packet violates that rule (but no other rules), then a Filter Fail will not occur, the packet will not be rejected, the packet will be treated as intended for the device, and software will be notified of the incoming packet. For a description of the function of the individual leniency bits, see the 802.15.4 Link Layer Controller chapter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PART_ID</name>
          <description>PART ID (PART_ID)</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PART_ID</name>
              <description>802.15.4 Part ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
