nxp-mcuxpresso/mcux-soc-svd/MCXW70AC/MCXW70AC.xml
        <register>
          <name>PROG_PKT_FLTR_LO_PATT_B</name>
          <description>no description available</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_LO_PATT_B</name>
              <description>PPME filter B: 32bit LSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_UP_PATT_B</name>
          <description>no description available</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_UP_PATT_B</name>
              <description>PPME filter B: 32bit MSB Rx Pattern programmed by software to be matched with the subfield of the incoming Rx Packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_LO_MSK_B</name>
          <description>no description available</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_LO_MSK_B</name>
              <description>PPME filter B: To mask off the bits not required to be compared between PKT_FLTR_LO_PATT_B and Rx packet buffer mask bit = 1 means &quot;no compare&quot; mask-bit = 0 means &quot;do compare&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_UP_MSK_B</name>
          <description>no description available</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_UP_MSK_B</name>
              <description>PPME filter B: To mask off the bits not required to be compared between PKT_FLTR_UP_PATT_B and Rx packet buffer mask bit = 1 means &quot;no compare&quot; mask-bit = 0 means &quot;do compare&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_CTRL_B</name>
          <description>no description available</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_OFST_B</name>
              <description>PPME_B: Offset to skip pattern match for any number of bytes between 0 to 127th byte of the packet buffer for pkt_fltr_patt_b</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_EN_B</name>
              <description>PPME_B: Set to enable packet filter for pkt_fltr_patt_b</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_REJECT_PKT_B</name>
              <description>PPME_B: Enable to abort the current packet. Disable to generate FILTERFAIL_IRQ interrupt and continue reception of the current packet.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_MAT_IRQ_MODE_B</name>
              <description>PPME_B: Disabled (1'b0) - There will be no patt_mat_irq_a generated in real time if pkt_fltr_patt_b matches and if there is No CRC failure. At the end of the receive only RXIRQ will be generated to signify the end of the packet. Enabled (1'b1) - interrupt patt_mat_irq_b will be generated in the real time.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_PAN_B</name>
              <description>PPME_B: PAN selector 0x0 - filter set a assigned to PAN0 0x1 - filter set a assigned to PAN1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_REJECT_AND</name>
              <description>When both filter sets A and B are enabled and packet rejection bits PKT_FLTR_REJECT_PKT_A, PKT_FLTR_REJECT_PKT_B is enabled software can select to reject the Rx packet if both patterns are not matched or either pattern is not matched. 0: Rx packet rejected if pkt_fltr_patt_a OR pkt_fltr_patt_b is not matched 1: Rx packet rejected if pkt_fltr_patt_a AND pkt_fltr_patt_b is not matched</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_CONCAT_PFAB</name>
              <description>To concatenate the pkt_fltr_patt_a + pkt_fltr_patt_b and receive interrupt patt_mat_irq_b only when complete pattern has matched</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_FLOAT_OFST_EN</name>
              <description>This bit is used to decide if pattern b offset should be fixed (configurable by software) or should be kept floating (anytime the match occurs).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_FRM_VER_B</name>
              <description>PPME_B: Packet Filter Frame Version selector for filter set B. The incoming packet's Frame Control Field is parsed to obtain the FrameVersion subfield, and that value is compared against this register, in accordance with the following: xxx1: Accept received packets with FrameVersion=00 xx1x: Accept received packets with FrameVersion=01 x1xx: Accept received packets with FrameVersion=10 1xxx: Accept received packets with FrameVersion=11</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_FRM_TYPE_B</name>
              <description>PPME filter B: Packet type selector for filter set B. Packet type can be parsed from Frame Control field and can be used to filter the packet types as per the settings in this register. xxxxxxx1 - Accept packets with Frame Type Beacon xxxxxx1x - Accept packets with Frame Type Data xxxxx1xx - Accept packets with Frame Type Acknowledgement xxxx1xxx - Accept packets with Frame Type MAC command. xxx1xxxx - Accept packets with Frame Type Reserved xx1xxxxx - Accept packets with Frame Type Multipurpose x1xxxxxx - Accept packets with Frame Type Fragment or Frak 1xxxxxxx - Accept packets with Frame Type Extended</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_ADDR_PRESENT</name>
          <description>SAM ADDRESS PRESENT (SAM_ADDR_PRESENT)</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAP0_ADDR_PRESENT</name>
              <description>A Checksum Match is Present in the SAP0 Partition of the SAM Table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_ADDR_ABSENT</name>
              <description>A Checksum Match is Absent in the SAA0 Partition of the SAM Table</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP1_ADDR_PRESENT</name>
              <description>A Checksum Match is Present in the SAP1 Partition of the SAM Table</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_ADDR_ABSENT</name>
              <description>A Checksum Match is Absent in the SAA1 Partition of the SAM Table</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_CTRL</name>
          <description>TIMER CONTROL (TIMER_CTRL)</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVENT_TMR_LD</name>
              <description>Event Timer Load Enable Loads the Event Timer with the values written to the EVENT_TMR[23:0] and EVENT_TMR_FRAC[3:0] fields of this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EVENT_TMR_ADD</name>
              <description>Event Timer Add Enable Increments the Event Timer by the values written to the EVENT_TMR[23:0] and EVENT_TMR_FRAC[3:0] fields of this register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EVNTMR_WKUP_TRIG_EN</name>
              <description>Configuration to trigger T[1-4]CMP comparison after a wakeup is detected. This bit is used only for the first TX or RX event after wakeup, and is self-cleared by HW.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CAPTURE_TIMESTAMP</name>
              <description>SW can write this bit to capture a snapshot of FP4_UNIVERSAL_CLOCK and Event Timer in UC_TIMESTAMP and TIMESTAMP registers. This bit is self-cleared by HW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TMSTMP_ANCHORED</name>
              <description>When set, CAPTURE_TIMESTAMP will capture an anchored TIMESTAMP of universal clock counter and event timer. This bit does not affect the timestamping at RX SFD detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RST_EVNTMR_AT_WKUP</name>
              <description>Bit to enable Event Timer reset at wakeup</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIV_CNTR_TIMESTAMP</name>
          <description>Universal Counter Timestamp (UNIV_CNTR_TIMESTAMP)</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNIV_CNTR_TIMESTAMP</name>
              <description>Timestamped value captured from FP4_UNIVERSAL_CLOCK counter at CAPTURE_TIMESTAMP assertion from SW. This TIMESTAMP is also updated at SFD detection when Event Timer TIMESTAMP is updated in ZLL TIMESTAMP register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UNIV_CLK_CNTR</name>
          <description>Universal Clock Counter Freerunning value (UNIV_CLK_CNTR)</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FP4_UNIVERSAL_CLOCK</name>
              <description>FP4_UNIVERSAL_CLOCK counter (live value) readback from d_ip_15p4_radio_syn block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENT_TMR_PRESET</name>
          <description>EVENT TIMER Preset value (EVENT_TMR_PRESET)</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVENT_TMR_PRESET</name>
              <description>for SW to provide the pre-set value to load into, or, add to, the Event Timer when EVENT_TMR_LD or EVENT_TMR_ADD bits in FFU_DSM_CTRL register are set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROG_PKT_FLTR_INTR_MSK_STS</name>
          <description>no description available</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKT_FLTR_IRQ_MASK_A</name>
              <description>PPME_A: if 1'b1: disable PKT_FLTR_IRQ_A to trigger FW IRQ (irq_b, ipi_int_modem_rx)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_IRQ_A</name>
              <description>PPME_A: Pattern match interrupt on PPME_A, generated if a pattern match was found in PPME_A, write 1 to clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PKT_FLTR_IRQ_MASK_B</name>
              <description>PPME_B: if 1'b1: disable PKT_FLTR_IRQ_B to trigger FW IRQ (irq_b, ipi_int_modem_rx)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKT_FLTR_IRQ_B</name>
              <description>PPME_B: Pattern match interrupt on PPME_B, generated if a pattern match was found in PPME_B, write 1 to clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PKT_FLTR_OFST_ERR_A</name>
              <description>PPME_A: Pattern offset error status. Generated at packet start if PKT_FLTR_OFST_A (+ASH index) exceeds the packet length, write 1 to clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PKT_FLTR_OFST_ERR_B</name>
              <description>PPME_B: Pattern offset error status. Generated at packet start if PKT_FLTR_OFST_B (+ASH index) exceeds the packet length, write 1 to clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PKT_FLTR_PAN_CFG_ERR</name>
              <description>PPME PAN configuration error in concatenation mode Set when the assigned PAN of PPME-A is not equal to the PAN of PPME-B</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SUMMARY</name>
          <description>no description available</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRQSTS_irq</name>
              <description>IRQSTS_IRQ = (SEQIRQ | TXIRQ | RXIRQ | CCAIRQ | RXWTRMKIRQ | FILTERFAIL_IRQ | PLL_INLOCK_IRQ | WAKE_IRQ | ARB_GRANT_DEASSERTION_IRQ | TSM_IRQ | (| TMR_IRQ_STATUS_TMR_IRQ (4:1) )</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENHACK_CTRL0_IRQ</name>
              <description>ENHACK_CTRL_IRQ = ( RECY_IRQ OR EMPTY_ACK_IRQ | ACK_ABORT_IRQ)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COEX_CTRL_IRQ</name>
              <description>COEX_TIMEOUT_IRQ</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XCVR_STATUS_IRQ</name>
              <description>TSM_IRQ</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROG_PKT_FLTR_INTR_MSK_STS_IRQ</name>
              <description>PPME IRQ status summary (PKT_FLTR_OFST_ERR_B | PKT_FLTR_OFST_ERR_A | PKT_FLTR_OFST_ERR_B | PKT_FLTR_OFST_ERR_A)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_FREE_IDX_FND</name>
          <description>SAM FREE INDEX FOUND (SAM_FREE_IDX_FND)</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAP0_1ST_FREE_IDX_FOUND</name>
              <description>Source Address Present #0 First Free Index found</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_1ST_FREE_IDX_FOUND</name>
              <description>Source Address Absent #0 First Free Index found</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sap1_1st_free_idx_found</name>
              <description>Source Address Present #1 First Free Index found</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_1ST_FREE_IDX_FOUND</name>
              <description>Source Address Absent #1 First Free Index found</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
