nxp-mcuxpresso/mcux-soc-svd/MCXW70AC/MCXW70AC.xml
        <register>
          <name>TIMING31</name>
          <description>TSM_TIMING31</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B087108</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_TX_HI</name>
              <description>Assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_TX_LO</name>
              <description>De-assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_RX_HI</name>
              <description>Assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_RX_LO</name>
              <description>De-assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING32</name>
          <description>TSM_TIMING32</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1911FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_RCCAL_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_RCCAL_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_RCCAL_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_RCCAL_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_RCCAL_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING33</name>
          <description>TSM_TIMING33</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x23115A11</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PD_EN_FCAL_BIAS_TX_HI</name>
              <description>Assertion time setting for SEQ_PD_EN_FCAL_BIAS (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_FCAL_BIAS_TX_LO</name>
              <description>De-assertion time setting for SEQ_PD_EN_FCAL_BIAS (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_FCAL_BIAS_RX_HI</name>
              <description>Assertion time setting for SEQ_PD_EN_FCAL_BIAS (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_EN_FCAL_BIAS_RX_LO</name>
              <description>De-assertion time setting for SEQ_PD_EN_FCAL_BIAS (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING34</name>
          <description>TSM_TIMING34</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B117111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_PD_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_PD_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_PD_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_PD_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_PD_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_PD_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING35</name>
          <description>TSM_TIMING35</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B117111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_VCO_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_VCO_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_VCO_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_VCO_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_VCO_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING36</name>
          <description>TSM_TIMING36</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B117111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_XO_DIST_EN_TX_HI</name>
              <description>Assertion time setting for SEQ_XO_DIST_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_TX_LO</name>
              <description>De-assertion time setting for SEQ_XO_DIST_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_RX_HI</name>
              <description>Assertion time setting for SEQ_XO_DIST_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_RX_LO</name>
              <description>De-assertion time setting for SEQ_XO_DIST_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING37</name>
          <description>TSM_TIMING37</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B117111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_REF_TX_HI</name>
              <description>Assertion time setting for SEQ_XO_DIST_EN_CLK_REF (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_REF_TX_LO</name>
              <description>De-assertion time setting for SEQ_XO_DIST_EN_CLK_REF (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_REF_RX_HI</name>
              <description>Assertion time setting for SEQ_XO_DIST_EN_CLK_REF (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_REF_RX_LO</name>
              <description>De-assertion time setting for SEQ_XO_DIST_EN_CLK_REF (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING38</name>
          <description>TSM_TIMING38</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B117111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_XO_EN_CLK_2P4G_TX_HI</name>
              <description>Assertion time setting for SEQ_XO_EN_CLK_2P4G (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_EN_CLK_2P4G_TX_LO</name>
              <description>De-assertion time setting for SEQ_XO_EN_CLK_2P4G (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_EN_CLK_2P4G_RX_HI</name>
              <description>Assertion time setting for SEQ_XO_EN_CLK_2P4G (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_EN_CLK_2P4G_RX_LO</name>
              <description>De-assertion time setting for SEQ_XO_EN_CLK_2P4G (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING39</name>
          <description>TSM_TIMING39</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B2B7111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_ADCDAC_TX_HI</name>
              <description>Assertion time setting for SEQ_XO_DIST_EN_CLK_ADCDAC (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_ADCDAC_TX_LO</name>
              <description>De-assertion time setting for SEQ_XO_DIST_EN_CLK_ADCDAC (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_ADCDAC_RX_HI</name>
              <description>Assertion time setting for SEQ_XO_DIST_EN_CLK_ADCDAC (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_XO_DIST_EN_CLK_ADCDAC_RX_LO</name>
              <description>De-assertion time setting for SEQ_XO_DIST_EN_CLK_ADCDAC (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING40</name>
          <description>TSM_TIMING40</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF7111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_DAC_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_DAC_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DAC_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_DAC_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DAC_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_DAC_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_DAC_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_DAC_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING41</name>
          <description>TSM_TIMING41</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF7111</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_VCO_EN_HPM_TX_HI</name>
              <description>Assertion time setting for SEQ_VCO_EN_HPM (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_EN_HPM_TX_LO</name>
              <description>De-assertion time setting for SEQ_VCO_EN_HPM (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_EN_HPM_RX_HI</name>
              <description>Assertion time setting for SEQ_VCO_EN_HPM (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_VCO_EN_HPM_RX_LO</name>
              <description>De-assertion time setting for SEQ_VCO_EN_HPM (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING42</name>
          <description>TSM_TIMING42</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B127112</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LO_PUP_VLO_FBK_TX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_FBK (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_FBK_TX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_FBK (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_FBK_RX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_FBK (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_FBK_RX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_FBK (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING43</name>
          <description>TSM_TIMING43</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B12FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LO_PUP_VLO_RX_TX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_RX (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RX_TX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_RX (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RX_RX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_RX (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RX_RX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_RX (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING44</name>
          <description>TSM_TIMING44</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B12FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LO_PUP_VLO_RXDRV_TX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_RXDRV (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RXDRV_TX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_RXDRV (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RXDRV_RX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_RXDRV (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_RXDRV_RX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_RXDRV (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING45</name>
          <description>TSM_TIMING45</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF7112</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LO_PUP_VLO_TX_TX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_TX (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TX_TX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_TX (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TX_RX_HI</name>
              <description>Assertion time setting for SEQ_LO_PUP_VLO_TX (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LO_PUP_VLO_TX_RX_LO</name>
              <description>De-assertion time setting for SEQ_LO_PUP_VLO_TX (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
