nxp-mcuxpresso/mcux-soc-svd/MCXW70AC/MCXW70AC.xml
        <register>
          <name>btu_pta_mws_scan_ovlp_range_29_31</name>
          <description>MWS Scan Frequency Overlap Range 29~31</description>
          <addressOffset>0xF76</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mws_scan_ovlp_range_29</name>
              <description>MWS scan frequency overlap range 29, The MWS scan frequency overlap range 29 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1101 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_30</name>
              <description>MWS scan frequency overlap range 30, The MWS scan frequency overlap range 30 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1110 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mws_scan_ovlp_range_31</name>
              <description>MWS scan frequency overlap range 31, The MWS scan frequency overlap range 31 register is indexed by MWS_SCAN_FREQUENCY[4:0] = 'b1_1111 during MWS scan operation. See mws_scan_ovlp_range_1 for bit field description.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_early_bt_rx_pri_ctrl</name>
          <description>MWS Coex Early BT_RX_PRI Control</description>
          <addressOffset>0xF78</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_rx_pri_mode</name>
              <description>BT_RX_PRI mode selection, These select the mode of operation for asserting the BT_RX_PRI signal., Bit[1] selects the Advance Mode. BT_RX_PRI signal assertion is based on earlyBtRxPri bit in Frame Descriptor programmed by firmware., Bit[0] selects the Real Time Mode. BT_RX_PRI signal is asserted in real time by hardware based on Bluetooth Rx packet's priority and event types.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_page_resp_mst</name>
              <description>BT_RX_PRI assertion during page response at master side, This bit enables BT_RX_PRI assertion by BTU for critical Rx during page response at master side.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_inq_resp</name>
              <description>BT_RX_PRI assertion during inquiry response, This bit enables BT_RX_PRI assertion by BTU for critical Rx during inquiry response.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_page_resp_slv</name>
              <description>BT_RX_PRI assertion during page response at slave side, This bit enables BT_RX_PRI assertion by BTU for critical Rx during page response at slave side.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_mst_tm_sel</name>
              <description>BT_RX_PRI advance timing selection in Real Time mode for Bluetooth master mode, select 100us or 600us range advance timing., 0x0: select 100us range (BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the Rx packet), 0x1: select 600us range (BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the preceding Tx, packet)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_page_resp_tm_sel</name>
              <description>BT_RX_PRI advance timing selection during master or slave page response, select 100us or 600us range advance timing, 0x0: select 100us range. For master; BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of each Rx ID, packet. For slave; BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from rifRx rising edge of the Rx FHS, packet., 0x1: select 600us range. For master; BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the first Tx ID, packet. For slave; BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from correlation hit of the first or second, Rx ID packet.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_inq_resp_tm_sel</name>
              <description>BT_RX_PRI advance timing selection during inquiry response, select 100us or 600us range advance timing, 0x0: select 100us range. BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the FHS packet., 0x1: select 600us range. BT_RX_PRI assertion is delayed by, BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the first Tx ID, packet.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>early_bt_rx_pri_deass_fram_cnt</name>
              <description>Number of frames BT_RX_PRI should be de-asserted, This frame counter register is used to track how many frames in advance firmware is programming. When the earlyBtRxPri bit in frame descriptor is set; hardware will load this register value into hardware counter. BTU will de-assert BT_RX_PRI with appropriate timing on the frame that this hardware counter decrements to zero. This way firmware only will program earlyBtRxPri frame bit once for one packet.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_drive</name>
              <description>Control BT_RX_PRI logic level directly, This bit allows firmware to control the outgoing BT_RX_PRI logic level directly in real time.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_rx_pri_assrt_lvl</name>
              <description>Specify priority level to assert BT_RX_PRI for BR/EDR packet, Only the coex_priority with the same or higher level than this setting will cause the assertion of BT_RX_PRI to BCA.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_pri_assrt_lvl</name>
              <description>Specify priority level to assert BT_RX_PRI for BLE packet, Only the coex_priority with the same or higher level than this setting will cause the assertion of BT_RX_PRI to BCA.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_early_bt_rx_pri_staroffst_mst</name>
          <description>MWS Coex Early BT_RX_PRI Start Offset for Master Mode</description>
          <addressOffset>0xF7A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>startoffsetmst</name>
              <description>Start Offset in Master Mode, Early indication BT_RX_PRI assertion time offset in Advance mode of MWS Coex when operating in master mode. Time unit is 0.25us. When the earlyBtRxPri bit in frame descriptor is set in master mode; hardware will assert BT_RX_PRI at (earlyBtRxPriStartOffsetMst * 0.25) us after the start of frame. The valid range is 0x2 ~ 0x1387 (1250us).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_early_bt_rx_pri_staroffst_slv</name>
          <description>MWS Coex Early BT_RX_PRI Start Offset for Slave Mode</description>
          <addressOffset>0xF7C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>startoffsetslv</name>
              <description>Start Offset in Slave Mode, Early indication BT_RX_PRI assertion time offset in Advance mode of MWS Coex when operating in slave mode. Time unit is 0.25us. When the earlyBtRxPri bit in frame descriptor is set in slave mode; hardware will assert BT_RX_PRI at (earlyBtRxPriStartOffsetSlv * 0.25) us after the start of frame. The valid range is 0x2 ~ 0x1387 (1250us).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_coex_bt_rx_pri_start_slv</name>
          <description>MWS Coex Signal BT_RX_PRI Start Timer for Slave Mode</description>
          <addressOffset>0xF7E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btrxpristartslvreg</name>
              <description>BT_RX_PRI Start Timer for Slave Mode, In Real Time mode; btRxPriStartSlvReg determines the delay from rifRx assertion (or correlation hit if bt_rx_pri_page_resp_tm_sel = 1) to the rising edge of BT_RX_PRI. The time between the rising edge of BT_RX_PRI to the rifRx assertion is (btRxPriStartSlvReg+1) unit of 0.25us., This value should never be program less than 1; other wise unexpected behavior will occur., - Resolution: 0.25 us., Since this signal can only assert on successful grant from BCA; this timing needs to be greater than the delay from rifRx to bca_grant_n.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_ant_switch_ctrl</name>
          <description>PTA Antenna Switch Control, Antenna switch control for BCA arbitration.</description>
          <addressOffset>0xF90</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bca_ant_switch_sts_bypass_en</name>
              <description>BCA antenna switch status bypass enable, When bca_ant_switch_sts_bypass_en is set; BCA antSwitchStatus is controlled by bca_ant_switch_sts_bypass_val register., 0x0: disable antSwitchStatus bypass, 0x1: enable antSwitchStatus bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bca_ant_switch_sts_bypass_val</name>
              <description>BCA antenna switch status bypass value, When bca_ant_switch_sts_bypass_en is set; BCA antSwitchStatus is controlled by this register., 0x0: set BCA antSwitchStatus to zero, 0x1: set BCA antSwitchStatus to one</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bca_ref_antenna</name>
              <description>BCA reference antenna override value, When bca_ref_antenna_override is set; BCA reference antenna is controlled by this register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bca_ref_antenna_override</name>
              <description>BCA reference antenna override, When bca_ref_antenna_override is set; BCA reference antenna is controlled by bca_ref_antenna register., 0x0: disable BCA refAntenna override, 0x1: enable BCA refAntenna override</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_rssi_arb_ctrl</name>
          <description>BTU RSSI Arbitration Control, RSSI Based arbitration register controls like feature enable; RSSI value from EBRAM or register selection; average RSSI orRSSI for last received packet</description>
          <addressOffset>0xFA4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rssi_arb_en</name>
              <description>RSSI based arbitration Feature enable, Software programable feature enable bit for enabling assertion of interface signals for RSSI based arbitration, 0x0: Disable interface signals used for RSSI based arbitration, 0x1: Enable interface signals used for RSSI based arbitrationEnable RSSI based, arbitration output signals</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
