nxp-mcuxpresso/mcux-soc-svd/MCXW70AC/MCXW70AC.xml
        <register>
          <name>CFPA_LC_STATE</name>
          <description>OEM Life cycle state.</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x963530CF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFPA_LC_STATE</name>
              <description>CFPA_LC_STATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CFPA_LC_STATE_3</name>
                  <description>Develop state</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFPA_LC_STATE_7</name>
                  <description>Develop 2 state</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFPA_LC_STATE_15</name>
                  <description>In-field state</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFPA_LC_STATE_90</name>
                  <description>Bricked stated</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFPA_LC_STATE_165</name>
                  <description>FA state</description>
                  <value>0xA5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFPA_LC_STATE_207</name>
                  <description>In-field locked state</description>
                  <value>0xCF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV_CFPA_LC_STATE</name>
              <description>INV_CFPA_LC_STATE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_CFPA_LC_STATE_48</name>
                  <description>In-field locked state</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_CFPA_LC_STATE_90</name>
                  <description>FA state</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_CFPA_LC_STATE_165</name>
                  <description>Bricked stated</description>
                  <value>0xA5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_CFPA_LC_STATE_240</name>
                  <description>In-field state</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_CFPA_LC_STATE_248</name>
                  <description>Develop 2 state</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_CFPA_LC_STATE_252</name>
                  <description>Develop state</description>
                  <value>0xFC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFPA_HEADER</name>
              <description>CFPA_HEADER</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CFPA_HEADER_38453</name>
                  <description>valid CFPA header, any other value will be invalid</description>
                  <value>0x9635</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OVP_STATE</name>
          <description>OVP PAD State</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OVP_PAD_STATE</name>
              <description>OVP PAD State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LIFECYCLE_STATE</name>
          <description>Chip LifeCycle State</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>CHIP_LC_STATE</name>
              <description>Chip LifeCycle State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_0</name>
                  <description>NXP_BLANK</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_1</name>
                  <description>NXP_FAB</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_3</name>
                  <description>DEVELOP</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_7</name>
                  <description>DEVELOP_2</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_15</name>
                  <description>IN_FIELD</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_31</name>
                  <description>OEM_FIELD_RETURN</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_127</name>
                  <description>NXP_FA</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_207</name>
                  <description>IN_FIELD_LOCKED</description>
                  <value>0xCF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_252</name>
                  <description>NXP_DEV</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHIP_LC_STATE_255</name>
                  <description>BRICKED</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INV_LIFECYCLE_STATE</name>
          <description>Invert version of LIFECYCLE_STATE</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>INV_CHIP_LC_STATE</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDAC0_INJECT_ERR</name>
          <description>MDAC0 Error Injection</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_PROT1</name>
              <description>RD_PROT1 Error Inject</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PROT1</name>
              <description>WR_PROT1 Error Inject</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_NONSECURE</name>
              <description>RD_NONSECURE Error Inject</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_NONSECURE</name>
              <description>WR_NONSECURE Error Inject</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DID</name>
              <description>RD_DID Error Inject</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_DID</name>
              <description>WR_DID Error Inject</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDAC1_INJECT_ERR</name>
          <description>MDAC1 Error Injection</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_PROT1</name>
              <description>RD_PROT1 Error Inject</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PROT1</name>
              <description>WR_PROT1 Error Inject</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_NONSECURE</name>
              <description>RD_NONSECURE Error Inject</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_NONSECURE</name>
              <description>WR_NONSECURE Error Inject</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DID</name>
              <description>RD_DID Error Inject</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_DID</name>
              <description>WR_DID Error Inject</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDAC2_INJECT_ERR</name>
          <description>MDAC2 Error Injection</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_PROT1</name>
              <description>RD_PROT1 Error Inject</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_PROT1</name>
              <description>WR_PROT1 Error Inject</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_PROT1_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_PROT1_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_NONSECURE</name>
              <description>RD_NONSECURE Error Inject</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_NONSECURE</name>
              <description>WR_NONSECURE Error Inject</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_NONSECURE_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_NONSECURE_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DID</name>
              <description>RD_DID Error Inject</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RD_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RD_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_DID</name>
              <description>WR_DID Error Inject</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WR_DID_0</name>
                  <description>Disable Inject Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WR_DID_1</name>
                  <description>Enable Inject Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
