nxp-mcuxpresso/mcux-soc-svd/MCXW70AC/MCXW70AC.xml
        <register>
          <name>XO_TEST</name>
          <description>XO Test Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2061E5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISEL</name>
              <description>XO Amplifier Current Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ISEL_0</name>
                  <description>40uA (min)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISEL_1</name>
                  <description>80uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISEL_5</name>
                  <description>240uA (default)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISEL_15</name>
                  <description>640uA (max)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDAC</name>
              <description>XO On-chip Load Capacitor Trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDAC_0</name>
                  <description>C_FIX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDAC_63</name>
                  <description>C_FIX + 14.36pF</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_OFF</name>
              <description>XO Load Capacitor Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUX_PD</name>
              <description>XO CLK_AUX_DRV Powerdown</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_FORCE</name>
              <description>XO Amplifier Force PTAT Startup</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DYN_ISEL</name>
              <description>XO Amplifier: enable current switching during startup</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DYN_CAP</name>
              <description>XO On-chip Load Capacitor: enable switching during startup</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_TRIM</name>
              <description>XO LDO Output Voltage Trim</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_TRIM_0</name>
                  <description>0.92V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_TRIM_1</name>
                  <description>0.885V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_TRIM_2</name>
                  <description>0.955V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_TRIM_3</name>
                  <description>1.011V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_BUMP</name>
              <description>XO LDO PTAT Current Bump</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDO_BUMP_0</name>
                  <description>PTAT current bump default</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDO_BUMP_1</name>
                  <description>PTAT current boost: +30%</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_FORCE</name>
              <description>XO LDO Force PTAT Startup</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XO_CDAC_TRIM</name>
              <description>XO fixed cap bank C_FIX trimming</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XO_CDAC_TRIM_0</name>
                  <description>5.19pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_CDAC_TRIM_1</name>
                  <description>3.81pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_CDAC_TRIM_2</name>
                  <description>2.44pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XO_CDAC_TRIM_3</name>
                  <description>1.98pF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
